-----------------------------
-- Inner Queries (Subqueries)

select * from Students;
select * from Groups;

-- запит, який повертає максимальну оцінку по всіх студентах

-- отримуємо всіх студентів, які мають максимальну оцінку

-- отримуємо всі групи, які мають максимальну кі-сть студентів


-- отримуємо всі групи, які мають максимальну або мінімальну кі-сть студентів


-- якщо запит повертає декілька значень, для перевірки можна використати оператор IN



-- показати всіх викладачів, в яких більша половина студентів мають відмінні оцінки



/* Subquery Operators
	- [NOT] EXISTS				  - повертає TRUE якщо запит повернув хоча б один запис
	- [> < >= <= <> =] ANY / SOME - повертає TRUE якщо хоча б одни запис відповідає умові
	- [> < >= <= <> =] ALL		  - повертає TRUE якщо всі записи відповідають умові
*/



/*
...
where/having [NOT] EXISTS (query)
...
*/
-- показати викладічів, які мають хоча б одну групу


-- показати групи, які мають хоча б одного студента з оцінкою 12


-- показати викладачів, які мають хоча б одного студента з іменем 'Taras'

-- показати групи в яких є хоча б один студент старше 20-ти
select Name
from Groups as g
where EXISTS (select Id
			  from Students as s
			  where DATEDIFF(YEAR, s.BirthDate, GETDATE()) >= 20 AND s.GroupId = g.Id);

/*
...
where/having [> < >= <= <> =] ANY/SOME / ALL (query)
...
*/
-- показати студентів, в яких ім'я співпадає з іменем якогось викладача

-- показати студентів, в яких дата народження більша за дату прийняття на роботу будь-якого викладача


-- показати студентів з ім'ям яке має хоча б одни студент іншої групи

-- показати студентів в яких оцінка більша за оцінки всіх студентів групи 'New-York'


-- показати викладачів які були прийняті на роботу раніше дати народження всіх їхніх студентів

